/*
 Localizable.strings
 Owncloud iOs Client
 
 Created by Javier Gonzalez on 7/17/12.
 */

/*
 Copyright (C) 2016, ownCloud GmbH.
 This code is covered by the GNU Public License Version 3.
 For distribution utilizing Apple mechanisms please see https://owncloud.org/contribute/iOS-license-exception/
 You should have received a copy of this license
 along with this program. If not, see <http://www.gnu.org/licenses/gpl-3.0.en.html>.
 */


//First Screen
"go_to_login" = "设置账号";
"you_need_an_account" = "设备上并无 $appname 账号，请先设置账号。";

//Login Screen
"testing_connection" = "正在测试连接";
"server_instance_not_found" = "无法找到服务器";
"secure_connection_established" = "成功建立安全连接";
"https_non_secure_connection_established" = "成功重定向到非安全连接";
"connection_established" = "成功建立连接";
"login_details" = "登录信息";
"username" = "用户名";
"password" = "密码";
"login" = "连接";
"cancel" = "取消";
"error_login_message" = "用户名或密码错误";
"error_updating_predefined_url" = "Server moved to a different URL. Please, authenticate again to update your account";
"ok" = "OK";
"url_sample" = "服务器地址 https://...";
"forbidden_characters_in_password" = "密码中包含不可用的字符";
"server" = "服务器";
"url" = "URL";
"session_expired" = "您的会话超时了，请重新连接";
"credentials_different_user" = "输入用户与此帐户的用户不符";
"auth_unsupported_auth_method" = "服务器不支持这种验证方式";
"saml_server_does_not_give_user_id" = "服务器无法返回一个正确的用户ID，请联系管理员";
"authentification_not_valid" = "当前服务器验证失败";
"error_too_many_http_redirects" = "建立连接时发生错误，请稍后再试。";
"retry" = "重试";
"help_link_login" = "亲，刚用$appname吗？";

//TabBarItems
"settings"="设置";
"files_tab"="文件";

//Uploading
"upload" = "上传";
"account" = "账号";
"location" = "地区：";
"photo_albums" = "相册";
"loading" = "载入中....";
"no_access_to_gallery" = "Please enable access to Photos and Videos for $appname. This option may be found in Settings > Privacy > Photos.";
"error" = "错误";
"upload_failed"="上传失败";
"redirection_problem"="URL redirect action is not supported";
"all_photos" = "All Photos";

//First View
"menu_upload" = "上传照片/视频";
"menu_folder" = "增加文件夹";
"menu_text_file" = "创建文本文件";
"sort_menu_title" = "排序";
"sort_menu_by_name_option" = "A-Z";
"sort_menu_by_modification_date_option" = "Newest-Oldest";

//Create/Edit File Text
"create_text_file" = "Create New Text File";
"title_view_new_text_file" = "New Text File";
"title_view_edit_text_file" = "Edit Text File";
"default_text_file_title" = "创建文本文件";
"title_text_file_placeholder" = "Title...";
"body_text_file_placeholder" = "...";
"error_text_file_exist" = "已经存在";
"error_file_name_empty" = "File name can not be empty.";
"no_changes_made" = "No changes have been made";
"no_file_downloaded" = "The file is not downloaded, you can not edit it";


//Create Folder
"create_folder" = "新建文件夹";
"folder_name" = "文件夹名称：";
"save" = "保存";
"folder_exist" = "Folder with given name already exists. Please enter another name.";
"folder_create_error"="无法创建文件夹";
"not_show_potrait"="Menu not available in landscape view. Please change to portrait view.";
"not_possible_create_folder" = "Folder could not be created.";

//FilesView
"confirm_to_delete_item" = "确认删除";
"yes" = "是";
"no" = "否";
"delete_from_device" = "Are you sure you want to delete this file from the device?";
"delete_from_server" = "Are you sure you want to delete this file from the server?";
"not_possible_connect_to_server" = "It is not possible to connect to the server at this time.";
"delete_folder_from_server" = "Are you sure you want to delete this folder from the server?";
"delete_local_server" = "Delete from device and server";
"delete_local" = "从设备删除";
"delete_server" = "从服务器删除";
"error_path" = "Unable to open this folder. Please make sure it exists";
"error_not_permission" = "You don't have permission to complete the operation";
"folders" = "文件夹";
"files" = "文件";
"folder" = "文件夹";
"file" = "文件";
"more_swipe" = "更多";
"message_not_files" = "这里还什么都没有。上传些东西吧！";
"maintenance_mode_on_server_message" = "It is not possible to connect to the server at this time. The server is currently in maintenance mode";

//Refresh file list
"release_refresh"="Release to refresh...";
"loading_refresh"="载入中....";
"pull_down_refresh"="Pull down to refresh.";

//Miscelanea
"back" = "返回";

//Preview
"open_with_label" = "打开";
"delete_label"= "删除";

//Open with
"file_cannot_be_opened" = "File cannot be opened";
"no_app_instaled_to_open_it" = "There is no installed application to open this kind of file.";

//WTClient messages (Download/Upload)
"establishing_connection" = "建立连接";
"not_establishing_connection" = "无法建立连接";
"connection_closed" = "停止连接";
"connection_lost" = "连接丢失";
"auth_failed" = "认证失败。";
"auth_passed" = "认证通过";
"request_file_not_found" = "Requested file not found on server";
"request_file_not_accesed" = "Requested file cannot be accessed";
"unknow_response_server" = "Error. Unexpected response from server.";
"uploading_data" = "上传中...";
"downloading_data" = "下载中...";
"transfer_complete" = "迁移完成";
"transfer_failed" = "迁移失败";
"download_file" = "Download file";

//Settings and PinCode
"title_app_pin" = "Passcode Lock";
"title_app_pin_and_touchID" = "Passcode Lock & Touch ID";
"title_app_pin_forced" = "Change Passcode Lock";
"enter_app_pin" = "输入密码";
"enter_app_pin_long_description_forced" = "Passcode required. You need to set a passcode to log in.";
"enter_app_pin_long_description" = "输入密码";
"reenter_app_pin" = "再次输入密码";
"remove_app_pin" = "移除密码";
"both_pass_not_same" = "The entered Passcodes are not the same";
"app_pin_incorrect" = "密码不正确";
"passcode_not_enabled" = "Enable passcode first";
"title_app_touchID" = "Touch ID";
"disconnect_button" = "与服务器断开连接";
"pin_removed" = "移除的密码";
"incorrect_pin" = "错误的密码";
"app_pin_stored" = "存储的密码";
"help" = "帮助";
"recommend_to_friend" = "推荐给朋友";
"send_feedback" = "发送反馈";
"manage_accounts" = "管理账号";
"add_new_account" = "添加新账号";
"user_exist" = "输入的用户已经存在";
"imprint_button" = "Impressum";
"title_instant_upload_photos"="Instant Upload Photos";
"title_instant_upload_videos"="Instant Upload Videos";
"title_background_instant_upload" = "Background Instant Upload";
"accounts_section" = "账号";
"security_section" = "安全";
"instant_updloads_section" = "即时上传";
"more_section" = "更多";
"unlock_app" = "Unlock $appname";
"passcode_forced_can_not_be_disabled" = "Passcode forced. Can not be disabled.";
"pending_migration_to_new_url" = "Enter to migrate to new URL";

//Downloading
"can_no_copy_to_gallery" = "This file cannot be copied to the gallery because it cannot be opened by the gallery";
"file_is_downloading" = "This file is already downloading";
"download_file_exist" = "Unable to open this file. Please make sure it exists";
"wait_to_download" = "正在准备下载";
"updating" = "正在更新....";
"msg_while_downloads" = "It is not possible to do this operation, please wait until the current download finishes";
"streaming_no_possible_ssl_self_signed" = "Streaming cannot be initialized because your server certificate is untrusted. File download will start automatically";

//SSL
"invalid_ssl_cert" = "The identity of the site could not be verified. Do you want to trust this certificate anyway?";
"connection_declined" = "Connection declined by user";

//Recent view
"recent_now"="刚刚";
"recent_minutes"="$minutes 分钟前";
"recent_minute"="$minutes 分钟前";
"recent_hours"="$hours hours ago";
"recent_hour"="$hours hour ago";
"recent_days"="$days 天前";
"recent_day"="$days 天前";
"recent_months"="$months months ago";
"recent_month"="$months month ago";

"uploads_tab"="上传";
"current_section"="当前";
"uploader_section"="已上传";
"nothing_was_upload_recently"="Nothing recently uploaded from this device";
"failed_uploader_section"="Failed Uploads";
"clear_successful"="清除成功";
"error_credential"="凭证错误";
"error_destiny_does_not_exist"="文件夹错误";
"error_file_exists"="Conflict error";
"error_permission" = "权限错误";
"error_not_allowed_by_firewall_rule" = "禁止上传";
"error_file_does_not_exist" = "Not available on the device";
"error_file_in_background" = "服务器错误";
"error_insufficient_storage" = "该账户没有足够的空间";
"error_file_invalid_characters" = "无效的字符";
"change_active_user"="Change the active user to";
"waiting_for_server"="Waiting for server connection";
"waiting_for_upload"="等待上传...";
"error_permission_alert_message" = "You don't have permission to upload to this folder";
"choose_folder" = "选择目录";

//Select Folder View
"upload_label"="上传至";
"create_button"="创建";
"choose_button"="选择(&C)...";

//Rename
"rename_long_press" = "重命名";
"rename_file_title" = "重命名";
"enter_new_name" = "新的名字：";
"rename_file_exist" = "File with given name already exists, please enter a different name";

//Move
"move_long_press" = "移动";
"move_to_label" = "移动到";
"file_exist" = "该文件已经存在在目标文件夹";
"override_file" = "Do you want to replace the existing file with this one?";
"accept" = "接受";
"error_folder_destiny_is_the_same" = "ERROR: it is not possible to move the folder to itself";
"original_file_exist" = "Unable to move the file. Please make sure it exists";
"original_folder_exist" = "Unable to move the folder. Please make sure it exists";

//Download folfer
"download_folder" = "下载文件夹";
"cancel_download" = "取消下载";

//Upload from other apps
"other_apps_title" = "目标位置";
"other_apps_account" = "账户";
"other_apps_folder" = "文件夹";
"other_apps_file_name" = "文件名";
"other_apps_send_to" = "上传到";
"error_moving_file" = "Unable to move the file. Make sure the destination folder exists";
"forbidden_characters_from_server" = "The name contains at least one invalid character";
"overwritte_title" = "覆盖";

//Social
"twitter_message" = "Try $twitteruser on your smartphone! ";
"facebook_message" = "Try $appname on your smartphone!\r\n";
"mail_recommendation_subject" = "Try $appname on your smartphone!";
"mail_recommendation_body" = "I want to invite you to use $appname on your smartphone!\r\nDownload here: ";
"device_not_support_mail" = "Please, configure your mail account";
"mail_feedback_subject" = "Feedback $appname";
"account_not_configure" = "Your device does not have the account configured. Go to Settings to configure it.";

//Storage
"of_storage" = "在";
"occupied_storage" = "occupied";
"storage" = "存储";
"storage_upgrade" = "增加空间";

//Jimmies
"this_file_is_older" = "有新版本";
"msg_update_file_0_bytes" = "The file on the server has 0 bytes. Do you want to overwrite the existing file on your device with this empty file?";

//Shared
"shared_tab" = "分享链接";
"message_not_shared_files" = "There are no files/folders shared by link yet.";
"message_not_shared_api_support" = "Sorry, sharing is not enabled on your server. Please contact your administrator";
"share_link_long_press" = "共享";
"unshare_link" = "取消共享链接";
"share_not_available_on_this_server" = "Sorry, this feature is not enabled on your server. Please contact your administrator";
"copy_link" = "复制链接";
"file_to_share_not_exist" = "Unable to share this file or folder. Please make sure it exists";
"file_to_unshare_not_exist" = "Unable to unshare this file or folder. Please make sure it exists";
"shared_link_protected_title" = "输入密码";
"shared_link_protected_message" = "To share the link you must enter a password to protect it.";
"pasword_empty" = "Password can not be empty";
"no_pasword" = "你必须输入密码";
"get_share_link" = "Get Public Link";
"set_expiration_time" = "设置过期时间";
"password_protect" = "密码保护";
"allow_editing" = "允许编辑";
"default_not_possible_msg" = "It is not possible to do this operation, try later please";
"share_user_group_indicator" = "群组";
"share_user_federated_indicator" = "远程";
"add_user_or_group_title" = "添加用户或用户组";
"share_with_users_or_groups" = "Shared with Users and Groups";
"not_share_with_users_yet"= "Not shared with any users yet";
"not_sharee_api_supported" = "Sorry, your server version does not allow share with users. Please contact your administrator";
"share_link_title" = "Public link";
"not_share_link_enabled_capabilities" = "Share Link is not enabled in this server. Please contact your administrator";
"shared_link_cannot_remove_password" = "Cannot remove the password";
"shared_link_cannot_remove_expiration_date" = "Cannot clear expiration date. Shares are required to have an expiration date";
"shared_link_mail_subject" = "$userName shared »$fileOrFolderName« with you";
"secured_link" = "安全";

//Shared privileges
"title_user_can_edit" = "可编辑";
"title_user_can_share" = "可共享";
"user_can_create" = "创建";
"user_can_change" = "更改";
"user_can_delete" = "删除";
"title_view_edit_user_privileges" = "Privileges";

//Favorites
"favorite" = "收藏";
"unfavorite" = "取消收藏";
"parent_folder_is_favorite" = "A folder that contains this file is already favorite";

//Available offline
"available_offline" = "Available offline";
"not_available_offline" = "Not available offline";
"parent_folder_is_available_offline_file_child" = "A folder that contains this file is already available offline";
"parent_folder_is_available_offline_folder_child" = "A folder that contains this folder is already available offline";

//Document provider
"error_login_doc_provider" = "Unable to access your account. Please use the $appname app to sign in first.";
"error_sending_file_to_document_picker" = "Error sending file to document picker";
"error_user_change_in_core_app" = "The user has been changed on the $appname app";
"error_connecting_with_server" = "It has not been possible to connect with the server, please, try it later";
"move_doc_provider_button" = "Move to this location";
"export_doc_provider_button" = "Export to this location";

//Instant uploads
"location_not_enabled"="Location Services not enabled";
"message_location_not_enabled"="Please go to Settings and turn on Location Services to enable instant photo uploads in the background.";

"access_photos_library_not_enabled" = "Access to Photos not enabled";
"message_access_photos_not_enabled" = "Please go to Setting and turn on Photo Access to allow instant photo uploads.";

//PDF reader
"page_of_pages" = "在"; //Example: 5 of 10

//Share in
"files_added" = "Files added";
"files_will_be_upload_next_time" = "The files will start to upload the next time that you open $appname";

//Help Guide main app
"title_help_slide_0" = "Welcome to $appname!";
"message_help_slide_0" = "Swipe to learn more";
"title_help_slide_1" = "即时上传";
"message_help_slide_1" = "Keep your photos safe";
"title_help_slide_2" = "Manage all your files";
"message_help_slide_2" = "You can delete, move";
"title_help_slide_3" = "共享";
"message_help_slide_3" = "You can share files and folders";
"title_help_slide_4" = "多账户";
"message_help_slide_4" = "Connect to all your clouds";
"title_help_slide_5" = "Your private files synced anywhere";
"message_help_slide_5" = "5";
"sign_in_button_help_guide" = "登录";
"skip_button_help_guide" = "跳过";

//Account menu
"menu_account_edit" = "Edit Password";
"menu_account_clear_cache" = "清除缓存";
"menu_account_log_out" = "删除账号";
